Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-54-56.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་གིས་སེམས་མངོན་པར་བརླན་པ་དེ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྗེས་སུ་བསྟན་པ་དེ་ནི་རྗེས་སུ་རྣམ་པར་སེམས།
en: Maitreya Sudhana, the head merchant’s son, his mind moistened by the instructions of the kalyāṇamitra, contemplated bodhisattva conduct.

source: སྔོན་གྱི་མཐའི་ལུས་མང་པོ་ཡང་དག་པར་སྤྱོད་པ་ཉམས་སུ་མ་བླངས་པར་ཆུད་ཟོས་པ་ལ་བསམ་པས་ནི་ལུས་ཀྱི་སྟོབས་རབ་ཏུ་བརྟན་པར་བྱེད།
en: Thinking of how his many bodies in the past had failed to practice perfect conduct, he made resolute the strength of his body.

source: སྔོན་གྱི་མཐའི་མུར་ཐུག་པའི་ལུས་དང་སེམས་ཡོངས་སུ་དག་ཀྱང་དོན་མེད་པར་འཁོར་བའི་སེམས་ཀྱི་རྒྱུད་དུ་གྱུར་པ་ལ་བསམ་པས་ནི་སེམས་དང་ཡིད་ལ་བྱ་བ་རབ་ཏུ་སྦྱོང་།
en: Thinking of how his body and mind throughout the past, even though pure, were the worthless continuation of a saṃsāric mind, he applied the attention of his mind to conduct.

source: སྔོན་གྱི་མཐའི་མུར་ཐུག་པའི་ལས་ཡང་དག་པ་མ་ཡིན་པས་འཇིག་རྟེན་གྱི་དོན་དུ་གཡེན་སྤྱོ་སྟེ། མིག་ཅེས་པར་ཤ་ཐང་བ་ལ་བསམ་པས་ནི་ད་ལྟར་བྱུང་བའི་དོན་ཤིན་ཏུ་གཅེས་པ་ལ་ལེགས་པར་བསྒྲུབ་པ་རྣམ་པར་སེམས།
en: Thinking how his actions throughout the past had been impure, had been devoted to the world, and were worthless hardships, he contemplated accomplishing in the present that which is very meaningful.

source: སྔོན་གྱི་མཐའི་མུར་ཐུག་པའི་ཡོངས་སུ་རྟོག་པ་ཡང་དག་པ་མ་ཡིན་པར་རྣམ་པར་བརྟགས་པ་ལས་བྱུང་བ་ཕྱིན་ཅི་ལོག་གིས་ཡིད་ལ་བྱ་བ་ཀུན་ནས་གླགས་པ་ལ་བསམ་པས་ནི། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཡང་དག་པའི་རྟོག་པས་མངོན་པར་འདུ་བྱ་བའི་སྟོབས་ཡང་དག་པར་བསྐྱེད།
en: Thinking how throughout the past he had developed thoughts through incorrect examination, he generated the strength to create the correct examination of bodhisattva conduct.

source: འདས་པའི་ལུས་ཀྱིས་བདག་གི་དོན་གྱི་སྦྱོར་བ་ལ་རྩོམ་རྩོམ་པའི་ཡུལ་ལ་ཡོངས་སུ་བསམ་པས་ནི། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྦྱོར་བ་ལས་ཁྱད་པར་དུ་འཕགས་པར་ལྷག་པའི་བསམ་པའི་སྟོབས་རབ་ཏུ་བརྟན་པར་བྱེད།
en: Thinking how his past bodies had a range of activity dedicated to engaging in self-benefit, he made firm the strength of his superior, higher motivation to engage in benefiting all beings.

source: སྔོན་འདོད་པ་ཡོངས་སུ་ཚོལ་ཚོལ་བའི་སྤྱོད་པ་རོ་མྱེད་པ་ལ་ཡོངས་སུ་བསམ་པས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་འཐོབ་པའི་སྦྱོར་བས་དབུགས་ཕྱིན་པ་ཆེན་པོ་འཐོབ་པའི་དབང་པོའི་ཤུགས་དྲག་པོ་རྣམ་པར་འཕེལ་བར་བྱེད།
en: Thinking how in the past he had the flavorless conduct of continually seeking what was desired, he increased the great force of the power for attaining relief through engaging in obtaining the Dharma of the buddhas.

source: འདས་པའི་དུས་ཀྱི་ལྷག་པའི་བསམ་པ་ཕྱིན་ཅི་ལོག་དང་ལྡན་པའི་སྦྱོར་བ་ལ་ཡོངས་སུ་བསམ་པས་ནི། ད་ལྟར་བྱུང་བའི་དུས་སུ་ཕྱིན་ཅི་ལོག་མེད་པ་དང་ལྡན་པའི་ཡང་དག་པའི་ལྟ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ལ་ཡི་དམ་བཅའ་བས་སེམས་ཀྱི་རྒྱུད་ཡོངས་སུ་རྒྱས་པར་བྱེད།
en: Thinking how in the past he had engaged in conduct through an incorrect motivation, he purified the flow of his mind in the present with a correct view that was free of error and with dedication to bodhisattva prayer.

source: སྔོན་གྱི་མཐའི་བརྩོན་འགྲུས་བརྩམས་པ་མི་ཆ་ལ་དོན་མ་ཡིན་པ་དང་། ཡོངས་སུ་མ་གྲུབ་པའི་བརྩོན་འགྲུས་ཉམས་སུ་བླངས་པ་ལ་ཡོངས་སུ་བསམ་པས་ནི། ད་ལྟར་བྱུང་བའི་དུས་སུ་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བསྡུ་བ་ལ་སྟ་གོན་དུ་གནས་པའི་བརྩོན་འགྲུས་ཆེན་པོ་རྩོམ་པའི་རྣམ་པར་གནོན་པས་ལུས་དང་སེམས་ཀྱི་གཟེངས་མཐོ་བ་ཡང་དག་པར་བསྐྱེད།
en: Thinking how in the past he fruitlessly had no diligence in his undertakings and practiced without diligence, in the present he motivated his mind and body by generating the diligence for remaining prepared to gather the Dharmas of the buddhas.

source: སྔོན་གྱི་མཐའི་མུར་ཐུག་པའི་འགྲོ་བ་ལྔའི་རྒྱུད་ཀྱི་ངན་སོང་དུ་བདག་དང་གཞན་བོར་བ་ལ་བརྟག་པས་ལུས་འཚོ་བ་མེད་པ་ཡོངས་སུ་གཟུང་བ་ལ་ཡང་དག་པར་བསམ་པས་ནི། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་བསྒྲུབ་པ་དང་། འགྲོ་བ་ཐམས་ཅད་ཉེ་བར་འཚོ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་བསྙེན་བཀུར་བར་ནུས་པའི་ལུས་ཡོངས་སུ་བཟུང་བས་དགའ་བ་དང་མོས་པའི་ཤུགས་དྲག་པོ་རྒྱ་ཆེན་པོ་རྣམ་པར་འཕེལ་བར་བྱེད།
en: Examining how he and others had been lost in the lower realms and the five classes of beings, and thinking how in the past he had not taken care of his body, he increased a vast, powerful rejoicing and aspiration for maintaining a body with the power to accomplish all the Dharmas of the buddhas, take care of all beings, and serve all kalyāṇamitras.

source: ད་ལྟར་བྱུང་བའི་ཚེར་མངོན་པར་གྲུབ་ཀྱང་རྒ་བ་དང་ན་བ་དང་འཆི་བ་དང་མྱ་ངན་གྱི་འབྱུང་གནས་སུ་གྱུར་ཏེ་འདུ་བ་དང་འབྲལ་བའི།
en: He looked upon the body he had attained at that present time as the basis for illness, death, and misery, as a treasure that comes together and comes apart, and as the cause and condition for dedication to the practice of bodhisattva conduct until the last future kalpa;

source: གཏེར་དུ་གྱུར་པའི་ལུས་ཀྱང་ཕྱི་མའི་མཐའི་བསྐལ་པའི་མུར་ཐུག་པར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ལ་བརྩོན་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བསྡུ་བ་ལ་བརྩོན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཞལ་ལྟ་ཞིང་ཞིང་ཐམས་ཅད་དུ་རྒྱུ་བ་དང་། ཆོས་སྨྲ་བ་ཐམས་ཅད་ལ་རིམ་གྲོར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བསྟན་པ་ཡོངས་སུ་བཟུང་བ་ལ་བརྩོན་པ་དང་། ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བའི་གྲོགས་སུ་གྱུར་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་མཐོང་བར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་བསྡུ་བ་ལ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་དང་། ཡེ་ཤེས་ཀྱི་ལུས་ཀྱི་རྒྱུ་དང་རྐྱེན་དུ་གྱུར་བ་ལ་བལྟས་ཤིང་དགེ་བའི་རྩ་བའི་དབང་པོ་དང་། ཤུགས་བསམ་གྱིས་མི་ཁྱབ་པ་རྣམ་པར་འཕེལ་བར་བྱེད་ཅིང་དེ་ལྟ་བུའི་སེམས་དང་། དེ་ལྟ་བུའི་ཡིད་ལ་བྱ་བ་དང་། ཚུལ་བཞིན་དེ་ལྟ་བུ་ལ་རབ་ཏུ་བརྩོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་མོས་པས་ཡང་དག་པར་བསྒྲུབས་པའི་དད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་བསྒྲུབས་པའི་ཉེ་བར་སེམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ལྷག་པའི་བསམ་པས་སྒྲོ་བཏགས་པའི་རིམ་གྲོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དབང་པོ་དང་བར་སྒྲོ་བཏགས་པའི་ཕུ་དུད་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྟོན་པ་ལ་མོས་པས་ཡང་དག་པར་བསྒྲུབས་པའི་དབང་པོ་དང་བའི་ཤུགས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་རིམ་གྲོས་བྱུང་བའི་སེམས་ཀྱི་མོས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དད་པ་ལས་ཡོངས་སུ་བྱུང་བའི་དགེ་བའི་རྩ་བའི་ཚོགས་དང་། བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་འདུ་བྱ་བ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲུབ་པའི་མཆོད་པ་རྣམ་པ་ཐ་དད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་མཉམ་པའི་ལུས་ཀྱི་ཐལ་མོ་སྦྱར་བ་དང་། འགྲོ་བའི་ལུས་ཐམས་ཅད་དུ་ཡོངས་སུ་བྱུང་བའི་མིག་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བལྟ་བ་དང་། འགྲོ་བར་མིང་བཏགས་པ་ཐམས་ཅད་དུ་སྒྲོ་བཏགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཆོས་མཉམ་པ་ཉིད་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱིས་སྤྲུལ་པ་ལས་བྱུང་བར་སྒྲོ་བཏགས་པའི་ལུས་ཀྱིས་བཏུད་ཅིང་ཕྱག་བྱ་བ་ཚད་མེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དབྱངས་ཀྱི་ཡན་ལག་རྣམ་པར་དག་པ་ལས་བྱུང་བའི་ལེགས་པར་བརྗོད་པའི་རྒྱན་མངོན་པར་བསྒྲུབ་པ་དང་། སྔོན་གྱི་མཐའ་དང་ད་ལྟར་བྱུང་བའི་དུས་སུ་བྱུང་བའི་སེམས་ཅན་གྱི་གནས་ཐམས་ཅད་ཡོངས་སུ་རྒྱས་པའི་དེ་བཞིན་གཤེགས་པའི་ཕོ་བྲང་མངོན་དུ་བྱས་པའི་འདུ་ཤེས་ཀྱི་རྣམ་པ་དང་། དེ་བཞིན་གཤེགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་བས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ཐམས་ཅད་དུ་ཁྱབ་པ་དང་། སྐྲའི་རྩེ་མོ་གཅིག་ལས་ཀྱང་ལྷག་པ་མེད་པར་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་བའི་རྗེས་སུ་སོང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་མིག་གི་ལམ་རྣམ་པར་དག་པར་སྒྲོ་བཏགས་པའི་མངོན་པར་ཤེས་པ་སྣང་བས་རྣམ་པར་དམྱིགས་པ་དང་། ཕྱོགས་ཀྱི་དྲ་བ་ཐ་དད་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའི་ཡིད་ཀྱི་སྐྱེ་མཆེད་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞི་ཐ་དད་པ་རྒྱས་པར་འགེངས་པའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྟོབས་དང་། ཆོས་ཐམས་ཅད་ལ་འཇུག་པའི་སྒོ་ནམ་མཁའི་དབྱིངས་ཀྱིས་ཀླས་ཏེ།
en: for dedication to ripening beings and possessing the Dharma of the buddhas; for dedication to seeing the tathāgatas, going to all realms, venerating all dharmabhāṇakas, and acquiring the teachings of all the tathāgatas; for help in the search for all Dharmas; for dedication to seeing all kalyāṇamitras and gathering all the Dharma of the buddhas; and for bodhisattva prayers and a body of wisdom. Thus he increased the inconceivable power and force of his roots of merit.

source: མཐས་གཏུགས་པ་ཐམས་ཅད་དུ་ཁྱབ་ལ། དུས་གསུམ་དུ་ཐ་མི་དད་ཅིང་རྒྱུན་མི་འཆད་པ་དང་། དད་པ་དང་མོས་པ་ལ་འཇུག་པའི་སྟོབས་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་སྣང་བའི་ཕྱོགས་ལ་ཞུགས་པས་ཡུལ་རྒྱ་མཚོའི་འགྲམ་གང་ན་བ་དེར་ཕྱིན་ཏེ། དེ་ལྟར་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་རིམ་གྲོ་དང་། ཕུ་དུད་དང་། མཆོད་པ་དང་། བསྟོད་པ་དང་། ཕྱག་བྱ་བ་དང་། བལྟ་བའི་བྱིན་གྱི་རླབས་དང་། སྨོན་ལམ་དང་། འདུ་ཤེས་ཀྱི་རྗེས་སུ་སོང་བ་དེ་ལྟ་བུའི་ཡིད་དང་ལྡན་པ་དང་། ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་ཚད་མེད་པའི་ས་དེ་ལྟ་བུ་ལ་ཞུགས་པའི་ཡེ་ཤེས་ཀྱི་མིག་གིས་ཁང་པ་བརྩེགས་པ་ཆེན་པོ་རྣམ་པར་སྣང་མཛད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་སྙིང་པོའི་སྒོ་ནས་ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་སྟེ།
en: With such a motivation, such thoughts, and such fundamental dedication, with the faith that is created by the belief of all bodhisattvas, with the regard that is created by the aspirations of all bodhisattvas, with the respect that is created by the higher motivation of all bodhisattvas, with the reverence that is created by the power of the belief of all bodhisattvas, with the strength of the power of belief that is created by the aspiration to buddhas by all bodhisattvas, with the mind’s belief that comes forth from the veneration of all bodhisattvas, with the accumulation of roots of merit that arise from the faith of all bodhisattvas, with the different kinds of offerings that are created from all the activities of all the bodhisattvas, with the body having the hands placed together in homage in the same way as that of all bodhisattvas, looking with the different kinds of vision of the bodies of all beings, with the equality of the Dharma of all who are designated as bodhisattvas for all who are designated as beings, with countless designated bodies bowing and paying homage that come from the miraculous manifestations through the prayers of all bodhisattvas, with the accomplishment of the display of recited praises that come from the aspects of the voices of all bodhisattvas, filled with the blessing of all the bodhisattvas in the past and present, with the direct perception of the residence of the tathāgatas, with the all-pervading enlightenment miraculously manifested by the tathāgatas and bodhisattvas, following the bodies of all bodhisattvas pervading nothing greater than a single hair, with the perception illuminated by the higher cognition that conceives of the pure path of vision of all bodhisattvas, with the mental āyatana that follows all the different networks of the directions, with the strength that accomplishes the prayer that pervades all the different surfaces in the realm of phenomena, with the gateways for entering all the Dharma pervading everywhere to the ends of the realm of space, continuously and with no difference in the three times, with the strength of entering faith and aspiration, and with the illumination of the instructions of the kalyāṇamitras spreading into the directions reaching the shore of the ocean of realms, Sudhana, the head merchant’s son, in that way, with a mind following such a perception of respect, veneration, offering, praise, homage, the blessing of seeing, and prayer, with the eyes of wisdom that comprehended such a level of the immeasurable field of activity of wisdom, prostrated himself at the door of the great kūṭāgāra called Vairocana­vyūhālaṃkāra­garbha.

source: ཕྱག་བྱས་སོ། །དེས་རྣམ་པ་དེ་ལྟ་བུའི་མངོན་པར་བསྒྲུབ་པའི་ཚུལ་ཡུད་ཙམ་ཏུ་རྣམ་པར་དཔྱད་དེ་མོས་པ་དང་དད་པ་ལས་བྱུང་བའི་ལྷག་པའི་བསམ་པ་དང་། སྨོན་ལམ་གྱིས་མངོན་པར་བསྒྲུབས་པའི་མཐུས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་དུ་བདག་ཉིད་རྒྱུན་མི་འཆད་པར་བྱིན་གྱིས་བརླབས་སོ།
en: In that way, for a moment he examined that kind of accomplishment and, through the power of accomplishment through the higher motivation and prayer that arise from aspiration and faith, was empowered to continuously be at the feet of all the tathāgatas.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་མངོན་སུམ་དུ་གནས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་གནས་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་ཐམས་ཅད་དང་། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་ཕོ་བྲང་ཐམས་ཅད་དང་། ཆོས་རིན་པོ་ཆེའི་གནས་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གནས་དང་། མཆོད་རྟེན་ཐམས་ཅད་དང་། མངོན་སུམ་དུ་གནས་པ་ནས།
en: In the same way, he was empowered to be directly before all bodhisattvas, before the locations of all kalyāṇamitras, before all the caityas of the tathāgatas, before all the statues of the tathāgatas, before all the palaces of the buddhas and bodhisattvas, before all the locations of the precious Dharma, and before the locations and caityas of all śrāvakas and pratyeka­buddhas.

source: འཕགས་པའི་ཚོགས་དང་སྦྱིན་པའི་གནས་དང་། བླ་མ་དང་ཕ་མ་ཐམས་ཅད་ཀྱི་བར་གྱི་འགྲོ་བའི་ཚོགས་ཐམས་ཅད་དང་། མངོན་སུམ་དུ་གནས་པ་རྒྱུན་མི་འཆད་པར་ཡེ་ཤེས་ཀྱི་ལུས་ཐ་མི་དད་པའི་ཚུལ་ལ་འཇུག་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་དང་། འདུ་ཤེས་ཀྱི་བྱིན་གྱི་རླབས་དང་། ཡེ་ཤེས་ཡིད་ལ་བྱ་བས་བྱིན་གྱིས་བརླབས་སོ།
en: He was continuously and directly present in all the gatherings of beings up to the gatherings of the āryas, in the places of offering, and before gurus and parents, through the way of undifferentiated wisdom bodies going everywhere with empowered perception and empowered by the mental activity of wisdom.

source: །ཁང་པ་བརྩེགས་པ་ཆེན་པོ་རྣམ་པར་སྣང་མཛད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་སྙིང་པོའི་སྒོ་ནས་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གོང་དུ་བརྗོད་པའི་དམིགས་པ་ཐམས་ཅད་ལ་ཡང་།
en: Just as there were those perceptions at the door of the great Vairocana­vyūhālaṃkāra­garbha kūṭāgāra, which have just been described, he was empowered in the same way to bow down and pay homage throughout the entire realm of phenomena.

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པའི་འདུད་ཅིང་ཕྱག་བྱ་བར་བྱིན་གྱིས་བརླབས་སོ། །དེ་བཞིན་དུ་ཕྱི་མའི་མཐའི་མུར་ཐུག་པར་རྒྱུན་འཆད་པ་མེད་པར་བྱིན་གྱིས་བརླབས་ཏེ། ནམ་མཁའི་དབྱིངས་ཚད་མེད་པ་དང་མཉམ་པ་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་སྒྲིབ་པ་མེད་པ་དང་མཉམ་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་དང་། མཉམ་པ་ཉིད་དང་། དེ་བཞིན་ཉིད་རྣམ་པར་མི་རྟོག་པ་དང་མཉམ་པ་ཉིད་དང་། གྲིབ་མ་ལྟ་བུའི་ཡེ་ཤེས་དང་། འདུ་ཤེས་ཀྱིས་རྒྱས་པར་དགང་བ་མཉམ་པ་ཉིད་དང་། རྨི་ལམ་ལྟ་བུའི་རྣམ་པར་དཔྱོད་པ་དང་མཉམ་པ་ཉིད་དང་། གཟུགས་བརྙན་ལྟ་བུའི་འཇིག་རྟེན་དང་། འགྲོ་བ་ཐམས་ཅད་རྣམ་པར་དམིགས་པའི་མཉམ་པ་ཉིད་དང་། རྒྱུ་དང་རྐྱེན་ལས་བྱུང་བས་སྒྲ་བརྙན་ལྟ་བུའི་མཉམ་པ་ཉིད་དང་། འབྱུང་བ་དང་འཇིག་པ་མི་སྐྱེ་བ་དང་། མཉམ་པའི་མཉམ་པ་ཉིད་དང་། རྐྱེན་དང་རྟེན་པའི་རྒྱུད་དངོས་པོ་མེད་པའི་རང་བཞིན་དང་མཉམ་པའི་མཉམ་པ་ཉིད་ཀྱིས་ལས་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་བྱུང་བའི་རྣམ་པར་སྨིན་པ་ལ་ནི་མོས་པར་བྱེད།
en: He was thus empowered continuously, throughout the future, by sameness with the extent of the measureless realm of space, by sameness with the realm of phenomena without obscuration, by sameness with reaching the limits of existences, by sameness with the nonconceptual true nature, by sameness with the pervasion of shadow-like knowledge and perceptions, by sameness with dream-like analysis, by sameness with reflection-like perception of all worlds and beings, by sameness with echo-like origination from causes and conditions, by sameness with birthlessness, by sameness with origination and destruction, and by sameness with causes and conditions that have the same nature as nonexistence, so that he was aspiring to ripening that occurs in accordance with karma;

source: རྒྱུ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་བྱུང་བའི་འབྲས་བུ་ལ་ནི་མོས་པར་བྱེད།
en: aspiring to results that occur in accordance with causes;

source: བསྩགས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་བྱུང་བའི་བྱ་བ་ཐམས་ཅད་ལ་ནི་མོས་པར་བྱེད།
en: aspiring to all activities that arise in accordance with accumulations;

source: དང་བ་ལས་ཡོངས་སུ་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་བྱུང་བ་ཐམས་ཅད་ལ་ནི་མོས་པར་བྱེད།
en: aspiring to the arising of all tathāgatas, which occurs in accordance with faith;

source: མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་བྱུང་བའི་སངས་རྒྱས་མཆོད་པའི་སྤྲུལ་པ་ཐམས་ཅད་ལ་ནི་མོས་པར་བྱེད།
en: aspiring to the emanation of offerings to all buddhas, which occurs in accordance with aspiration;

source: རིམ་གྲོ་ལས་བྱུང་བའི་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་ཐམས་ཅད་ལ་ནི་མོས་པར་བྱེད།
en: aspiring to the miraculous manifestations of all tathāgatas, which occur according to veneration;

source: དགེ་བའི་རྩ་བའི་ཚོགས་ལས་ཡོངས་སུ་བྱུང་བའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཉིད་ལ་ནི་མོས་པར་བྱེད།
en: aspiring to the nature of all the buddhas, which occurs in accordance with the accumulation of roots of merit;

source: ཤེས་རབ་དང་ཐབས་ལས་ཡོངས་སུ་བྱུང་བའི་རྒྱན་ཡིད་ཀྱི་རང་བཞིན་ཏུ་བསྒྲུབས་པ་ཐམས་ཅད་ལ་ནི་མོས་པར་བྱེད།
en: aspiring to the accomplishment of displays, which occurs in accordance with method and wisdom;

source: སྨོན་ལམ་ལས་ཡོངས་སུ་བྱུང་བའི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་ནི་མོས་པར་བྱེད།
en: aspiring to the Dharmas of all buddhas, which occur according to prayer; aspiring to all bodhisattva conduct and its all-pervasive display of the accomplishment of the entire realm of phenomena as the field of perception of omniscience, which occur according to prayers of dedication, and with the wisdom of prayers of dedication, which is free from the conception of nothingness; with the wisdom of birthlessness, which is free from the conception of eternality; with the wisdom of entry into correct conduct and the accumulation of causes, which is free from false views concerning causes and actions; with the nonerroneous wisdom that is free from erroneous views; with the wisdom of nondependence, which is free from the view of independence;

source: བསྔོ་བ་ལས་ཡོངས་སུ་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་དང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་མཁྱེན་པའི་ཡུལ་དུ་གྱུར་པ་རྣམ་པར་བསྒྲུབ་པས་རྒྱས་པར་དགང་བའི་རྒྱན་ལ་ནི་མོས་པར་བྱེད་ཅིང་ཡོངས་སུ་བསྔོ་བའི་ཡེ་ཤེས་ཆད་པའི་འདུ་ཤེས་དང་བྲལ་བ་དང་། སྐྱེ་བ་མེད་པའི་ཡེ་ཤེས་རྟོག་པའི་འདུ་ཤེས་མེད་པ་དང་། ཡང་དག་པའི་སྤྱོད་པ་ལ་འཇུག་ཅིང་རྒྱུ་ཉེ་བར་སྩོགས་པའི་ཡེ་ཤེས་རྒྱུ་དང་བྱ་བའི་ལྟ་བ་མེད་པ་དང་། ཕྱིན་ཅི་ལོག་མེད་པའི་ཡེ་ཤེས་ཕྱིན་ཅི་ལོག་གི་ལྟ་བ་དང་བྲལ་བ་དང་། གཞན་གྱི་དྲིང་མི་འཇོག་པའི་ཡེ་ཤེས་དབང་ཕྱུག་ཏུ་ལྟ་བ་མེད་པ་དང་། རྟེན་པ་ལ་འཇུག་པའི་ཡེ་ཤེས་བདག་དང་ཕ་རོལ་གྱི་འདུ་ཤེས་ཀྱི་ལྟ་བ་དང་། བྲལ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་མཐའ་དང་དབུས་མེད་པ་ལ་འཇུག་པའི་ཡེ་ཤེས་མཐར་འཛིན་པའི་ལྟ་བ་དང་བྲལ་བ་དང་། གཟུགས་བརྙན་ལྟ་བུར་མངོན་པར་གྲུབ་པའི་ཡེ་ཤེས་འཕོ་བའི་ལྟ་བ་མེད་པ་དང་། མི་སྐྱེ་མི་འགག་པའི་ཡེ་ཤེས་སྐྱེ་བ་དང་། འཇིག་པའི་ལྟ་བ་དང་བྲལ་བ་དང་། སྟོང་པ་ཉིད་ཀྱིས་མི་སྐྱེ་བའི་ཡེ་ཤེས་ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་དང་བྲལ་བ་དང་། སྨོན་ལམ་མངོན་པར་སྒྲུབ་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དབང་ཕྱུག་མེད་པའི་ཆོས་ཉིད་རབ་ཏུ་རྟོགས་པ་དང་། མཚན་མ་མེད་པའི་མཐའི་སྒོ་དང་ལྡན་པའི་ཡེ་ཤེས་མཚན་མ་ཐམས་ཅད་དང་བྲལ་བས་ས་བོན་ལས་མྱུ་གུ་ཆུད་མི་ཟ་བའི་ཆོས་ཉིད་དང་། རྒྱ་ལས་རྒྱའི་གཟུགས་བརྙན་འབྱུང་བའི་ཆོས་ཉིད་དང་། གཟུགས་ལས་གཟུགས་བརྙན་འབྱུང་བའི་ཆོས་ཉིད་དང་། སྒྲ་བརྙན་དང་སྒྲར་མཉམ་པ་རྣམ་པར་དམིགས་པའི་ཆོས་ཉིད་དང་རྣམ་པར་དཔྱོད་པ་དང་། རྨི་ལམ་དུ་མཉམ་པར་རྣམ་པར་དམིགས་པའི་ཆོས་ཉིད་དང་། སྒྱུ་མའི་རྣམ་པ་ལྟར་ལས་ལས་ཡོངས་སུ་བྱུང་བའི་ཆོས་ཉིད་དང་། སེམས་གཟུགས་མེད་པས་འཇིག་རྟེན་ཡོངས་སུ་བསྐྱེད་པའི་ཆོས་ཉིད་དང་། རྐྱེན་དང་རྒྱུ་ཇི་ལྟར་བསྩགས་པ་བཞིན་དུ།
en: with the wisdom that understands dependence, which is free from the view of the concept of self and other; with the wisdom that enters the realm of phenomena that has no center or edge, which is free from the view that fixates on extremes; with the wisdom that accomplishes similarity to reflections, which is free from the view of the transference of skandhas ; with the wisdom of there being neither creation nor cessation, which is free from the view of birth and destruction; with the wisdom of the birthlessness of emptiness, which is free of all views; with the strength of the wisdom that accomplishes prayers, which has the realization of the nature of phenomena as being devoid of independent existence; with the wisdom that has the gateway to the apex of the absence of characteristics, which is devoid of all characteristics; through the indestructible nature of phenomena that seedlings come from sprouts; through the nature of phenomena that a seal’s image is produced by a seal; through the nature of phenomena that a reflection comes from a visible form; through the nature of phenomena that an echo is perceived as being the same as a sound; through the nature of phenomena that analysis is perceived to be the same as a dream; through the nature of phenomena that the production of actions is the same as conjured illusions; through the nature of phenomena that the world is produced by the formless mind;

source: འབྲས་བུ་འབྱུང་བའི་ཆོས་ཉིད་དང་ལས་ཇི་ལྟར་བསྩགས་པ་དང་། མཉམ་པར་རྣམ་པར་སྨིན་པ་འབྱུང་བའི་ཆོས་ཉིད་དང་། ཐབས་མཁས་པས་རྣམ་པར་བསྒྲུབས་པའི་ཆོས་ཉིད་དང་། ཆོས་དང་ཆོས་མ་ཡིན་པ་མཉམ་པ་ཉིད་ཀྱི་མངོན་པར་བརླན་པའི་ཆོས་ཉིད་དང་། ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འཇུག་པ་དེ་ལྟ་བུས་མངོན་པར་བསྒྲུབས་པའི་འདུ་ཤེས་དང་། ཡིད་ལ་བྱ་བས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཁང་པ་བརྩེགས་པ་རྣམ་པར་སྣང་མཛད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་སྙིང་པོའི་སྒོ་ནས་རྣམ་པ་དེ་ལྟ་བུར་བཏུད་དེ།
en: through the nature of phenomena that results arise in accordance with the conditions and causes that have been accumulated; through the nature of phenomena that the ripening of results occurs in accordance with the karma that has been accumulated; through the nature of phenomena of manifestations through skill in methods; through the nature of phenomena of being moistened by the sameness of that which is Dharma and that which is not Dharma; and through the perception and mentation of the attainment of such an entry into wisdom, Sudhana, the head merchant’s son, bowed down and paid homage at the door of the great Vairocana­vyūhālaṃkāra­garbha kūṭāgāra.

source: ཕྱག་འཚལ་ནས་ཡུན་རིང་མོ་ཞིག་ལོན་པ་དང་། དགེ་བའི་རྩ་བའི་ཤུགས་བསམ་གྱིས་མི་ཁྱབ་པས་མངོན་པར་བརླན་པའི་སེམས་དང་ལྡན་པ་ལུས་དང་སེམས་ཤིན་ཏུ་སིམ་པར་གྱུར་པ་དེ། ཁང་པ་བརྩེགས་པའི་སྒོའི་གནས་ནས་ལངས་ཏེ། ཡུད་ཙམ་ཞིག་ཏུ་ཁང་པ་བརྩེགས་པ་ཆེན་པོ་རྣམ་པར་སྣང་མཛད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་སྙིང་པོ་དེ་ལ་མིག་མི་འགེབས་པས་བལྟས་ནས།
en: Then, for a long time, with his mind saturated by the inconceivable force of his roots of merit, with well-being of body and mind, he stood at the gateway of the kūṭāgāra and for a little while gazed unblinking at the Vairocana­vyūhālaṃkāra­garbha kūṭāgāra.

source: ཐལ་མོ་སྦྱར་ཏེ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས།
en: Then with palms together in homage, he circumambulated it many hundreds of thousands of times.

source: དེ་ལྟ་བུའི་འདུ་ཤེས་དང་། ཡིད་ལ་བྱ་བས་བསྐུལ་བའི་སེམས་དང་ལྡན་པས།
en: Then, with his mind inspired by that kind of perception and mentation, he said these words:

source: ཚིག་ཏུ་བརྗོད་པ་འདི་ནི་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ་རྣམས་ཀྱི་གནས་སོ།
en: “This is the dwelling of those who are present within the dwelling of emptiness, the absence of characteristics, and the absence of aspiration;

source: །འདི་ནི་ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་མི་རྟོག་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ་རྣམས་ཀྱི་གནས་སོ།
en: of those who are present within the dwelling of the indivisibility of the realm of the Dharma;

source: །ཆོས་ཀྱི་དབྱིངས་ཐ་མི་དད་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ་སེམས་ཅན་གྱི་ཁམས་མི་དམིགས་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present within the dwelling of the imperceptibility of the realm of beings;

source: ཆོས་ཐམས་ཅད་མི་སྐྱེ་བའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present within the dwelling of the birthlessness of all phenomena;

source: འཇིག་རྟེན་ཐམས་ཅད་གནས་མེད་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present within the dwelling of the locationlessness of all worlds;

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་གནས་གནས་མྱེད་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present within the dwelling of the baselessness of all beings;

source: གནས་ཐམས་ཅད་རྣམ་པར་བསྒོམས་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present within the dwelling of meditation on all locations;

source: བརྟེན་པ་ཐམས་ཅད་ལ་མི་རྟེན་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present within the dwelling of nondependence on any source of dependence;

source: ལུས་ཐམས་ཅད་ལ་མི་རྟེན་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present within the dwelling of nonreliance on any body;

source: འདུ་ཤེས་ཀྱི་རྣམ་པ་ཐམས་ཅད་བསྩལ་བའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ་རྣམས་ཀྱི་གནས་སོ། །འདི་ནི་ཆོས་ཐམས་ཅད་རང་བཞིན་མེད་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ་རྣམས་ཀྱི་གནས་སོ། །རྟོག་པ་དང་རྣམ་པར་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་དུ།
en: of those who are present within the dwelling of the elimination of all conceptions; of those who are present within the dwelling of the absence in all phenomena of a nature of their own;

source: རྣམ་པར་མི་རྟོག་པའི་གནས་ལ་རྣམ་པར་སྤྱོད་པ།
en: of those who are present within the dwelling of not conceiving any illusory thoughts, ideas, or concepts;

source: འདུ་ཤེས་དང་སེམས་དང་ཡིད་ཐམས་ཅད་ཀྱིས་རྣམ་པར་དབེན་པའི་གནས་ལ་སྤྱོད་པ།
en: of those who are present within the dwelling of the absence of conception, mind, and mentation;
